TexasInstruments/motor-control-sdk/examples/tidep_01032_dual_motor_drive/single_chip_servo/am243x-lp/r5fss0-1_nortos/example.syscfg
section9.$name                       = "Log Shared Memory";
section9.load_memory                 = "LOG_SHM_MEM";
section9.type                        = "NOLOAD";
section9.group                       = false;
section9.output_section.create(1);
section9.output_section[0].$name     = ".bss.log_shared_mem";
section9.output_section[0].alignment = 0;

section10.$name                       = "IPC Shared Memory";
section10.type                        = "NOLOAD";
section10.load_memory                 = "RTOS_NORTOS_IPC_SHM_MEM";
section10.group                       = false;
section10.output_section.create(1);
section10.output_section[0].$name     = ".bss.ipc_vring_mem";
section10.output_section[0].alignment = 0;

section11.$name                       = "SDFM Samples";
section11.group                       = false;
section11.load_memory                 = "R5F_TCMB0_SDDF_0_1";
section11.type                        = "NOLOAD";
section11.output_section.create(1);
section11.output_section[0].$name     = ".gSddfChSampsRaw";
section11.output_section[0].alignment = 4;

section12.$name                       = "TX Data";
section12.group                       = false;
section12.load_memory                 = "R5F_TCMB0_PDO";
section12.output_section.create(1);
section12.output_section[0].$name     = ".gTxDataSection";
section12.output_section[0].alignment = 4;

section13.$name                       = "RX Data";
section13.group                       = false;
section13.load_memory                 = "OTHER_R5F_TCMB0_PDO";
section13.output_section.create(1);
section13.output_section[0].$name     = ".gRxDataSection";
section13.output_section[0].alignment = 4;

section14.$name                       = "Debug Buffer 1";
section14.group                       = false;
section14.load_memory                 = "MSRAM1";
section14.output_section.create(1);
section14.output_section[0].$name     = ".gDebugBuff1";
section14.output_section[0].alignment = 4;

section15.group                       = false;
section15.$name                       = "Debug Buffer 2";
section15.load_memory                 = "MSRAM2";
section15.output_section.create(1);
section15.output_section[0].alignment = 4;
section15.output_section[0].$name     = ".gDebugBuff2";

section16.$name                       = "ENDAT Channel Info";
section16.group                       = false;
section16.type                        = "NOLOAD";
section16.load_memory                 = "R5F_TCMB0_ENC_0_1";
section16.output_section.create(1);
section16.output_section[0].$name     = ".gEnDatChInfo";
section16.output_section[0].alignment = 4;

section17.$name                        = "Critical Code and Data";
section17.group                        = false;
section17.load_memory                  = "R5F_TCMB0";
section17.output_section.create(2);
section17.output_section[0].$name      = ".critical_code";
section17.output_section[0].alignment  = 4;
section17.output_section[0].palignment = true;
section17.output_section[1].$name      = ".critical_data";
section17.output_section[1].palignment = true;

section18.$name                        = "Control Variables";
section18.group                        = false;
section18.load_memory                  = "MSRAM_CTRL_VARS_0_1";
section18.output_section.create(1);
section18.output_section[0].$name      = ".gCtrlVars";
section18.output_section[0].palignment = true;

section19.$name                        = "User Shared Memory 2";
section19.group                        = false;
section19.load_memory                  = "USER_SHM_MEM";
section19.output_section.create(2);
section19.output_section[0].$name      = ".gSharedPrivStep";
section19.output_section[0].palignment = true;
section19.output_section[1].$name      = ".gSharedPruHandle";
section19.output_section[1].palignment = true;

section20.$name                        = "No Cache Memory";
section20.group                        = false;
section20.load_memory                  = "MSRAM_NO_CACHE";
section20.output_section.create(1);
section20.output_section[0].$name      = ".gEtherCatCia402";
section20.output_section[0].alignment  = 4;
section20.output_section[0].palignment = true;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm3.EPWM.B.$suggestSolution = "GPMC0_AD10";
epwm4.EPWM.B.$suggestSolution = "GPMC0_AD14";
